# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
# tap 'cesarandreu/asdf'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'

# CLI tools
brew 'bash'
brew 'cloc'
brew 'coreutils'
brew 'exiftool'
brew 'fish'
brew 'fzf'
brew 'git'
brew 'highlight'
brew 'htop', args: ['with-ncurses']
brew 'imagemagick', args: ['with-webp']
brew 'jq'
brew 'less'
brew 'mas'
brew 'media-info'
brew 'pv'
brew 'rmtrash'
brew 'rsync'
brew 'shellcheck'
brew 'socat'
brew 'stow'
brew 'tag'
brew 'the_silver_searcher'
brew 'tree'
brew 'youtube-dl'

# brew 'ffmpeg', args: ['with-chromaprint', 'with-fdk-aac', 'with-libvorbis', 'with-libvpx', 'with-opus']
# brew 'findutils'
# brew 'openssl'
# brew 'watchman'

# App Store
mas 'BetterSnapTool', id: 417375580
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'The Unarchiver', id: 425424353
mas 'Xcode', id: 497799835

# Setup required
cask '1password'
cask 'discord'
cask 'keybase'
cask 'little-snitch'
cask 'sourcetree'
cask 'sublime-text-dev'
cask 'textual'

# Browsers
cask 'chromium'
cask 'firefoxdeveloperedition'
cask 'safari-technology-preview'
cask 'torbrowser'

# Misc
cask 'android-file-transfer'
cask 'android-platform-tools'
cask 'disk-inventory-x'
cask 'docker'
cask 'etcher'
cask 'filezilla'
cask 'google-play-music-desktop-player'
cask 'gpgtools-beta'
cask 'handbrake'
cask 'iina'
cask 'mpv'
cask 'transmission'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'xquartz-beta'

# IDEs
cask 'intellij-idea-eap-nextversion'
cask 'webstorm-eap'

# Quick Look plugins
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlmobi'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'

# Fonts
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-oxygen'
cask 'font-oxygen-mono'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-ubuntu'

# cask 'adium'
# cask 'android-studio'
# cask 'calibre'
# cask 'google-cloud-sdk'
# cask 'gyazo'
# cask 'java'
# cask 'licecap'
# cask 'postgrespreferencepane'
# cask 'rcdefaultapp'
# cask 'sequel-pro'
# cask 'sonarr'
# cask 'vagrant'

# brew 'aria2'
# brew 'autossh'
# brew 'coreutils'
# brew 'flac'
# brew 'git-extras'
# brew 'gnu-sed'
# brew 'gnu-sed', args: ['with-default-names']
# brew 'gnuplot'
# brew 'go'
# brew 'goaccess'
# brew 'graphicsmagick'
# brew 'graphviz'
# brew 'grep'
# brew 'hub'
# brew 'imagemagick'
# brew 'irssi'
# brew 'megatools'
# brew 'memcached'
# brew 'mitmproxy'
# brew 'moreutils'
# brew 'moreutils'
# brew 'mpc'
# brew 'mpd'
# brew 'ncdu'
# brew 'ncdu'
# brew 'ncmpc'
# brew 'ncmpcpp'
# brew 'nginx'
# brew 'optipng'
# brew 'postgresql'
# brew 'redis'
# brew 'rename'
# brew 'screen'
# brew 'sshuttle'
# brew 'tag'
# brew 'tmux'
# brew 'vim', args: ['with-override-system-vi']
# brew 'webp'
# brew 'wget', args: ['with-iri']
# brew 'wrk'

# Run arbitrary commands when files change (http://entrproject.org)
# brew 'entr'
